run/cases/pelletExtruder/AMI/SHM (copy)/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{    
       
    inlet
    {
        type            zeroGradient;  
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    
    "barrelup.*"
    {
        type            zeroGradient;
    }
      
    "barreldown.*"
    {
        type            zeroGradient;
    }
    
    "screwup.*"
    {
        type            zeroGradient;
    }

    "screwdown.*"
    {
        type            zeroGradient;
    }
    
    AMI1
    {
        type            cyclicAMI;
    }
    AMI2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
